Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/include/pio/pic32cz4010ca80176.h
#define PIN_PD12L_ETH_RX_CLK                       _UINT32_(108)
#define MUX_PD12L_ETH_RX_CLK                       _UINT32_(11)
#define PINMUX_PD12L_ETH_RX_CLK                    ((PIN_PD12L_ETH_RX_CLK << 16) | MUX_PD12L_ETH_RX_CLK)
#define PORT_PD12L_ETH_RX_CLK                      (_UINT32_(1) << 12)

#define PIN_PA22K_ETH_TSUCOMP                      _UINT32_(22)
#define MUX_PA22K_ETH_TSUCOMP                      _UINT32_(10)
#define PINMUX_PA22K_ETH_TSUCOMP                   ((PIN_PA22K_ETH_TSUCOMP << 16) | MUX_PA22K_ETH_TSUCOMP)
#define PORT_PA22K_ETH_TSUCOMP                     (_UINT32_(1) << 22)

#define PIN_PC05K_ETH_TSUCOMP                      _UINT32_(69)
#define MUX_PC05K_ETH_TSUCOMP                      _UINT32_(10)
#define PINMUX_PC05K_ETH_TSUCOMP                   ((PIN_PC05K_ETH_TSUCOMP << 16) | MUX_PC05K_ETH_TSUCOMP)
#define PORT_PC05K_ETH_TSUCOMP                     (_UINT32_(1) << 5)

#define PIN_PC17K_ETH_TSUCOMP                      _UINT32_(81)
#define MUX_PC17K_ETH_TSUCOMP                      _UINT32_(10)
#define PINMUX_PC17K_ETH_TSUCOMP                   ((PIN_PC17K_ETH_TSUCOMP << 16) | MUX_PC17K_ETH_TSUCOMP)
#define PORT_PC17K_ETH_TSUCOMP                     (_UINT32_(1) << 17)

#define PIN_PA01K_ETH_TXD0                         _UINT32_(1) 
#define MUX_PA01K_ETH_TXD0                         _UINT32_(10)
#define PINMUX_PA01K_ETH_TXD0                      ((PIN_PA01K_ETH_TXD0 << 16) | MUX_PA01K_ETH_TXD0)
#define PORT_PA01K_ETH_TXD0                        (_UINT32_(1) << 1)

#define PIN_PA00K_ETH_TXD1                         _UINT32_(0) 
#define MUX_PA00K_ETH_TXD1                         _UINT32_(10)
#define PINMUX_PA00K_ETH_TXD1                      ((PIN_PA00K_ETH_TXD1 << 16) | MUX_PA00K_ETH_TXD1)
#define PORT_PA00K_ETH_TXD1                        (_UINT32_(1) << 0)

#define PIN_PD04K_ETH_TXD2                         _UINT32_(100)
#define MUX_PD04K_ETH_TXD2                         _UINT32_(10)
#define PINMUX_PD04K_ETH_TXD2                      ((PIN_PD04K_ETH_TXD2 << 16) | MUX_PD04K_ETH_TXD2)
#define PORT_PD04K_ETH_TXD2                        (_UINT32_(1) << 4)

#define PIN_PD03K_ETH_TXD3                         _UINT32_(99)
#define MUX_PD03K_ETH_TXD3                         _UINT32_(10)
#define PINMUX_PD03K_ETH_TXD3                      ((PIN_PD03K_ETH_TXD3 << 16) | MUX_PD03K_ETH_TXD3)
#define PORT_PD03K_ETH_TXD3                        (_UINT32_(1) << 3)

#define PIN_PD17K_ETH_TXD4                         _UINT32_(113)
#define MUX_PD17K_ETH_TXD4                         _UINT32_(10)
#define PINMUX_PD17K_ETH_TXD4                      ((PIN_PD17K_ETH_TXD4 << 16) | MUX_PD17K_ETH_TXD4)
#define PORT_PD17K_ETH_TXD4                        (_UINT32_(1) << 17)

#define PIN_PD16K_ETH_TXD5                         _UINT32_(112)
#define MUX_PD16K_ETH_TXD5                         _UINT32_(10)
#define PINMUX_PD16K_ETH_TXD5                      ((PIN_PD16K_ETH_TXD5 << 16) | MUX_PD16K_ETH_TXD5)
#define PORT_PD16K_ETH_TXD5                        (_UINT32_(1) << 16)

#define PIN_PD15K_ETH_TXD6                         _UINT32_(111)
#define MUX_PD15K_ETH_TXD6                         _UINT32_(10)
#define PINMUX_PD15K_ETH_TXD6                      ((PIN_PD15K_ETH_TXD6 << 16) | MUX_PD15K_ETH_TXD6)
#define PORT_PD15K_ETH_TXD6                        (_UINT32_(1) << 15)

#define PIN_PD14K_ETH_TXD7                         _UINT32_(110)
#define MUX_PD14K_ETH_TXD7                         _UINT32_(10)
#define PINMUX_PD14K_ETH_TXD7                      ((PIN_PD14K_ETH_TXD7 << 16) | MUX_PD14K_ETH_TXD7)
#define PORT_PD14K_ETH_TXD7                        (_UINT32_(1) << 14)

#define PIN_PA02K_ETH_TXEN                         _UINT32_(2) 
#define MUX_PA02K_ETH_TXEN                         _UINT32_(10)
#define PINMUX_PA02K_ETH_TXEN                      ((PIN_PA02K_ETH_TXEN << 16) | MUX_PA02K_ETH_TXEN)
#define PORT_PA02K_ETH_TXEN                        (_UINT32_(1) << 2)

#define PIN_PD02K_ETH_TXER                         _UINT32_(98)
#define MUX_PD02K_ETH_TXER                         _UINT32_(10)
#define PINMUX_PD02K_ETH_TXER                      ((PIN_PD02K_ETH_TXER << 16) | MUX_PD02K_ETH_TXER)
#define PORT_PD02K_ETH_TXER                        (_UINT32_(1) << 2)

#define PIN_PA21K_ETH_TX_CLK                       _UINT32_(21)
#define MUX_PA21K_ETH_TX_CLK                       _UINT32_(10)
#define PINMUX_PA21K_ETH_TX_CLK                    ((PIN_PA21K_ETH_TX_CLK << 16) | MUX_PA21K_ETH_TX_CLK)
#define PORT_PA21K_ETH_TX_CLK                      (_UINT32_(1) << 21)

#define PIN_PD05K_ETH_TX_CLK                       _UINT32_(101)
#define MUX_PD05K_ETH_TX_CLK                       _UINT32_(10)
#define PINMUX_PD05K_ETH_TX_CLK                    ((PIN_PD05K_ETH_TX_CLK << 16) | MUX_PD05K_ETH_TX_CLK)
#define PORT_PD05K_ETH_TX_CLK                      (_UINT32_(1) << 5)

/* ========== PORT definition for GCLK peripheral ========== */
#define PIN_PC20M_GCLK_IO0                         _UINT32_(84)
#define MUX_PC20M_GCLK_IO0                         _UINT32_(12)
#define PINMUX_PC20M_GCLK_IO0                      ((PIN_PC20M_GCLK_IO0 << 16) | MUX_PC20M_GCLK_IO0)
#define PORT_PC20M_GCLK_IO0                        (_UINT32_(1) << 20)

#define PIN_PC19M_GCLK_IO1                         _UINT32_(83)
#define MUX_PC19M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PC19M_GCLK_IO1                      ((PIN_PC19M_GCLK_IO1 << 16) | MUX_PC19M_GCLK_IO1)
#define PORT_PC19M_GCLK_IO1                        (_UINT32_(1) << 19)

#define PIN_PD00M_GCLK_IO2                         _UINT32_(96)
#define MUX_PD00M_GCLK_IO2                         _UINT32_(12)
#define PINMUX_PD00M_GCLK_IO2                      ((PIN_PD00M_GCLK_IO2 << 16) | MUX_PD00M_GCLK_IO2)
#define PORT_PD00M_GCLK_IO2                        (_UINT32_(1) << 0)

#define PIN_PD01M_GCLK_IO3                         _UINT32_(97)
#define MUX_PD01M_GCLK_IO3                         _UINT32_(12)
#define PINMUX_PD01M_GCLK_IO3                      ((PIN_PD01M_GCLK_IO3 << 16) | MUX_PD01M_GCLK_IO3)
#define PORT_PD01M_GCLK_IO3                        (_UINT32_(1) << 1)

#define PIN_PC00M_GCLK_IO4                         _UINT32_(64)
#define MUX_PC00M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PC00M_GCLK_IO4                      ((PIN_PC00M_GCLK_IO4 << 16) | MUX_PC00M_GCLK_IO4)
#define PORT_PC00M_GCLK_IO4                        (_UINT32_(1) << 0)

#define PIN_PD18M_GCLK_IO4                         _UINT32_(114)
#define MUX_PD18M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PD18M_GCLK_IO4                      ((PIN_PD18M_GCLK_IO4 << 16) | MUX_PD18M_GCLK_IO4)
#define PORT_PD18M_GCLK_IO4                        (_UINT32_(1) << 18)

#define PIN_PC01M_GCLK_IO5                         _UINT32_(65)
#define MUX_PC01M_GCLK_IO5                         _UINT32_(12)
#define PINMUX_PC01M_GCLK_IO5                      ((PIN_PC01M_GCLK_IO5 << 16) | MUX_PC01M_GCLK_IO5)
#define PORT_PC01M_GCLK_IO5                        (_UINT32_(1) << 1)

#define PIN_PD19M_GCLK_IO5                         _UINT32_(115)
#define MUX_PD19M_GCLK_IO5                         _UINT32_(12)
#define PINMUX_PD19M_GCLK_IO5                      ((PIN_PD19M_GCLK_IO5 << 16) | MUX_PD19M_GCLK_IO5)
#define PORT_PD19M_GCLK_IO5                        (_UINT32_(1) << 19)

#define PIN_PC02M_GCLK_IO6                         _UINT32_(66)
#define MUX_PC02M_GCLK_IO6                         _UINT32_(12)
#define PINMUX_PC02M_GCLK_IO6                      ((PIN_PC02M_GCLK_IO6 << 16) | MUX_PC02M_GCLK_IO6)
#define PORT_PC02M_GCLK_IO6                        (_UINT32_(1) << 2)

#define PIN_PD20M_GCLK_IO6                         _UINT32_(116)
#define MUX_PD20M_GCLK_IO6                         _UINT32_(12)
#define PINMUX_PD20M_GCLK_IO6                      ((PIN_PD20M_GCLK_IO6 << 16) | MUX_PD20M_GCLK_IO6)
#define PORT_PD20M_GCLK_IO6                        (_UINT32_(1) << 20)

#define PIN_PC03M_GCLK_IO7                         _UINT32_(67)
#define MUX_PC03M_GCLK_IO7                         _UINT32_(12)
#define PINMUX_PC03M_GCLK_IO7                      ((PIN_PC03M_GCLK_IO7 << 16) | MUX_PC03M_GCLK_IO7)
#define PORT_PC03M_GCLK_IO7                        (_UINT32_(1) << 3)

#define PIN_PD21M_GCLK_IO7                         _UINT32_(117)
#define MUX_PD21M_GCLK_IO7                         _UINT32_(12)
#define PINMUX_PD21M_GCLK_IO7                      ((PIN_PD21M_GCLK_IO7 << 16) | MUX_PD21M_GCLK_IO7)
#define PORT_PD21M_GCLK_IO7                        (_UINT32_(1) << 21)

