Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/include/pio/pic32cz4010ca80176.h
#define PIN_PB29P_PTC_DRV20                        _UINT32_(61)
#define MUX_PB29P_PTC_DRV20                        _UINT32_(15)
#define PINMUX_PB29P_PTC_DRV20                     ((PIN_PB29P_PTC_DRV20 << 16) | MUX_PB29P_PTC_DRV20)
#define PORT_PB29P_PTC_DRV20                       (_UINT32_(1) << 29)

#define PIN_PF05P_PTC_DRV21                        _UINT32_(165)
#define MUX_PF05P_PTC_DRV21                        _UINT32_(15)
#define PINMUX_PF05P_PTC_DRV21                     ((PIN_PF05P_PTC_DRV21 << 16) | MUX_PF05P_PTC_DRV21)
#define PORT_PF05P_PTC_DRV21                       (_UINT32_(1) << 5)

#define PIN_PB28P_PTC_DRV22                        _UINT32_(60)
#define MUX_PB28P_PTC_DRV22                        _UINT32_(15)
#define PINMUX_PB28P_PTC_DRV22                     ((PIN_PB28P_PTC_DRV22 << 16) | MUX_PB28P_PTC_DRV22)
#define PORT_PB28P_PTC_DRV22                       (_UINT32_(1) << 28)

#define PIN_PB27P_PTC_DRV23                        _UINT32_(59)
#define MUX_PB27P_PTC_DRV23                        _UINT32_(15)
#define PINMUX_PB27P_PTC_DRV23                     ((PIN_PB27P_PTC_DRV23 << 16) | MUX_PB27P_PTC_DRV23)
#define PORT_PB27P_PTC_DRV23                       (_UINT32_(1) << 27)

#define PIN_PC02P_PTC_ECI0                         _UINT32_(66)
#define MUX_PC02P_PTC_ECI0                         _UINT32_(15)
#define PINMUX_PC02P_PTC_ECI0                      ((PIN_PC02P_PTC_ECI0 << 16) | MUX_PC02P_PTC_ECI0)
#define PORT_PC02P_PTC_ECI0                        (_UINT32_(1) << 2)

#define PIN_PC03P_PTC_ECI1                         _UINT32_(67)
#define MUX_PC03P_PTC_ECI1                         _UINT32_(15)
#define PINMUX_PC03P_PTC_ECI1                      ((PIN_PC03P_PTC_ECI1 << 16) | MUX_PC03P_PTC_ECI1)
#define PORT_PC03P_PTC_ECI1                        (_UINT32_(1) << 3)

/* ========== PORT definition for SDMMC0 peripheral ========== */
#define PIN_PC15I_SDMMC0_SDCD                      _UINT32_(79)
#define MUX_PC15I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PC15I_SDMMC0_SDCD                   ((PIN_PC15I_SDMMC0_SDCD << 16) | MUX_PC15I_SDMMC0_SDCD)
#define PORT_PC15I_SDMMC0_SDCD                     (_UINT32_(1) << 15)

#define PIN_PC08I_SDMMC0_SDCK                      _UINT32_(72)
#define MUX_PC08I_SDMMC0_SDCK                      _UINT32_(8) 
#define PINMUX_PC08I_SDMMC0_SDCK                   ((PIN_PC08I_SDMMC0_SDCK << 16) | MUX_PC08I_SDMMC0_SDCK)
#define PORT_PC08I_SDMMC0_SDCK                     (_UINT32_(1) << 8)

#define PIN_PC13I_SDMMC0_SDCMD                     _UINT32_(77)
#define MUX_PC13I_SDMMC0_SDCMD                     _UINT32_(8) 
#define PINMUX_PC13I_SDMMC0_SDCMD                  ((PIN_PC13I_SDMMC0_SDCMD << 16) | MUX_PC13I_SDMMC0_SDCMD)
#define PORT_PC13I_SDMMC0_SDCMD                    (_UINT32_(1) << 13)

#define PIN_PC09I_SDMMC0_SDDAT0                    _UINT32_(73)
#define MUX_PC09I_SDMMC0_SDDAT0                    _UINT32_(8) 
#define PINMUX_PC09I_SDMMC0_SDDAT0                 ((PIN_PC09I_SDMMC0_SDDAT0 << 16) | MUX_PC09I_SDMMC0_SDDAT0)
#define PORT_PC09I_SDMMC0_SDDAT0                   (_UINT32_(1) << 9)

#define PIN_PC10I_SDMMC0_SDDAT1                    _UINT32_(74)
#define MUX_PC10I_SDMMC0_SDDAT1                    _UINT32_(8) 
#define PINMUX_PC10I_SDMMC0_SDDAT1                 ((PIN_PC10I_SDMMC0_SDDAT1 << 16) | MUX_PC10I_SDMMC0_SDDAT1)
#define PORT_PC10I_SDMMC0_SDDAT1                   (_UINT32_(1) << 10)

#define PIN_PC11I_SDMMC0_SDDAT2                    _UINT32_(75)
#define MUX_PC11I_SDMMC0_SDDAT2                    _UINT32_(8) 
#define PINMUX_PC11I_SDMMC0_SDDAT2                 ((PIN_PC11I_SDMMC0_SDDAT2 << 16) | MUX_PC11I_SDMMC0_SDDAT2)
#define PORT_PC11I_SDMMC0_SDDAT2                   (_UINT32_(1) << 11)

#define PIN_PC12I_SDMMC0_SDDAT3                    _UINT32_(76)
#define MUX_PC12I_SDMMC0_SDDAT3                    _UINT32_(8) 
#define PINMUX_PC12I_SDMMC0_SDDAT3                 ((PIN_PC12I_SDMMC0_SDDAT3 << 16) | MUX_PC12I_SDMMC0_SDDAT3)
#define PORT_PC12I_SDMMC0_SDDAT3                   (_UINT32_(1) << 12)

#define PIN_PC14I_SDMMC0_SDWP                      _UINT32_(78)
#define MUX_PC14I_SDMMC0_SDWP                      _UINT32_(8) 
#define PINMUX_PC14I_SDMMC0_SDWP                   ((PIN_PC14I_SDMMC0_SDWP << 16) | MUX_PC14I_SDMMC0_SDWP)
#define PORT_PC14I_SDMMC0_SDWP                     (_UINT32_(1) << 14)

/* ========== PORT definition for SDMMC1 peripheral ========== */
#define PIN_PC28I_SDMMC1_SDCD                      _UINT32_(92)
#define MUX_PC28I_SDMMC1_SDCD                      _UINT32_(8) 
#define PINMUX_PC28I_SDMMC1_SDCD                   ((PIN_PC28I_SDMMC1_SDCD << 16) | MUX_PC28I_SDMMC1_SDCD)
#define PORT_PC28I_SDMMC1_SDCD                     (_UINT32_(1) << 28)

#define PIN_PC30I_SDMMC1_SDCK                      _UINT32_(94)
#define MUX_PC30I_SDMMC1_SDCK                      _UINT32_(8) 
#define PINMUX_PC30I_SDMMC1_SDCK                   ((PIN_PC30I_SDMMC1_SDCK << 16) | MUX_PC30I_SDMMC1_SDCK)
#define PORT_PC30I_SDMMC1_SDCK                     (_UINT32_(1) << 30)

#define PIN_PG03I_SDMMC1_SDCMD                     _UINT32_(195)
#define MUX_PG03I_SDMMC1_SDCMD                     _UINT32_(8) 
#define PINMUX_PG03I_SDMMC1_SDCMD                  ((PIN_PG03I_SDMMC1_SDCMD << 16) | MUX_PG03I_SDMMC1_SDCMD)
#define PORT_PG03I_SDMMC1_SDCMD                    (_UINT32_(1) << 3)

#define PIN_PC31I_SDMMC1_SDDAT0                    _UINT32_(95)
#define MUX_PC31I_SDMMC1_SDDAT0                    _UINT32_(8) 
#define PINMUX_PC31I_SDMMC1_SDDAT0                 ((PIN_PC31I_SDMMC1_SDDAT0 << 16) | MUX_PC31I_SDMMC1_SDDAT0)
#define PORT_PC31I_SDMMC1_SDDAT0                   (_UINT32_(1) << 31)

#define PIN_PG00I_SDMMC1_SDDAT1                    _UINT32_(192)
#define MUX_PG00I_SDMMC1_SDDAT1                    _UINT32_(8) 
#define PINMUX_PG00I_SDMMC1_SDDAT1                 ((PIN_PG00I_SDMMC1_SDDAT1 << 16) | MUX_PG00I_SDMMC1_SDDAT1)
#define PORT_PG00I_SDMMC1_SDDAT1                   (_UINT32_(1) << 0)

#define PIN_PG01I_SDMMC1_SDDAT2                    _UINT32_(193)
#define MUX_PG01I_SDMMC1_SDDAT2                    _UINT32_(8) 
#define PINMUX_PG01I_SDMMC1_SDDAT2                 ((PIN_PG01I_SDMMC1_SDDAT2 << 16) | MUX_PG01I_SDMMC1_SDDAT2)
#define PORT_PG01I_SDMMC1_SDDAT2                   (_UINT32_(1) << 1)

#define PIN_PG02I_SDMMC1_SDDAT3                    _UINT32_(194)
#define MUX_PG02I_SDMMC1_SDDAT3                    _UINT32_(8) 
#define PINMUX_PG02I_SDMMC1_SDDAT3                 ((PIN_PG02I_SDMMC1_SDDAT3 << 16) | MUX_PG02I_SDMMC1_SDDAT3)
#define PORT_PG02I_SDMMC1_SDDAT3                   (_UINT32_(1) << 2)

#define PIN_PC27I_SDMMC1_SDWP                      _UINT32_(91)
#define MUX_PC27I_SDMMC1_SDWP                      _UINT32_(8) 
#define PINMUX_PC27I_SDMMC1_SDWP                   ((PIN_PC27I_SDMMC1_SDWP << 16) | MUX_PC27I_SDMMC1_SDWP)
#define PORT_PC27I_SDMMC1_SDWP                     (_UINT32_(1) << 27)

/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_PC00D_SERCOM0_PAD0                     _UINT32_(64)
#define MUX_PC00D_SERCOM0_PAD0                     _UINT32_(3) 
#define PINMUX_PC00D_SERCOM0_PAD0                  ((PIN_PC00D_SERCOM0_PAD0 << 16) | MUX_PC00D_SERCOM0_PAD0)
#define PORT_PC00D_SERCOM0_PAD0                    (_UINT32_(1) << 0)

#define PIN_PC01D_SERCOM0_PAD1                     _UINT32_(65)
#define MUX_PC01D_SERCOM0_PAD1                     _UINT32_(3) 
#define PINMUX_PC01D_SERCOM0_PAD1                  ((PIN_PC01D_SERCOM0_PAD1 << 16) | MUX_PC01D_SERCOM0_PAD1)
#define PORT_PC01D_SERCOM0_PAD1                    (_UINT32_(1) << 1)

